In [11]:
import pandas as pd

In [12]:
list_match = pd.read_excel('E:/data/list_match.xlsx')

In [13]:
strategy = pd.read_excel('E:/data/strategy.xlsx')

In [14]:
list_match

   list_id            Name
0        1           shika
1        2           treka
2        3  salem eldosary
3        4          amoory

In [15]:
strategy

   str_id            Name
0       1  salem eldosary
1       2           shika
2       3         mohamed
3       4           ahmed

In [16]:
pd.merge(list_match,strategy, how = 'inner' , on = 'Name' )

   list_id            Name  str_id
0        1           shika       2
1        3  salem eldosary       1

In [17]:
pd.merge(list_match , strategy , how='left' , on='Name')

   list_id            Name  str_id
0        1           shika     2.0
1        2           treka     NaN
2        3  salem eldosary     1.0
3        4          amoory     NaN

In [19]:
pd.merge(list_match , strategy , how='right' , on='Name')

   list_id            Name  str_id
0      3.0  salem eldosary       1
1      1.0           shika       2
2      NaN         mohamed       3
3      NaN           ahmed       4

In [20]:
pd.merge(list_match , strategy , how='outer' , on='Name')

   list_id            Name  str_id
0      1.0           shika     2.0
1      2.0           treka     NaN
2      3.0  salem eldosary     1.0
3      4.0          amoory     NaN
4      NaN         mohamed     3.0
5      NaN           ahmed     4.0